{
  "garage": {
    "gameStart": "You awaken to find yourself in a strange room...\nYou have no idea where you are or how you got here.\nYou rub your eyes and look around to see the room only has one door.\nOn the left side of the room is a small table with what seems to be a note sitting on it.",
    "note": "Welcome to Eric's house!\n\tFind your way through the rooms to escape. Each room has a locked door\n\tthat will take you to the next room. It can be unlocked by solving the\n\tchallenge of that room.\n\tOh, I almost forgot.\n\tEric is also here and he’s looking for you.\n\tIt would be in your best interest to not let him find you.\n\tThe more attempts it takes to solve a challenge the more likely it is\n\the stumbles into the same room.\n\tGOOD LUCK!",
    "poster": "What a cool collection of posters.\nLooks like you and Eric have the same taste in movies,\n too bad he's trying to catch you.",
    "car": "This is a pretty cool ride\nLooks like Eric's family Station Wagon.\nYou try the handle but the car is locked.\n",
    "dresser": "I like this dresser, such a great use of storage!\nOh and look A FROGGIE IS ON TOP OF ONE OF THEM!\n",
    "door": "You better read that note before you head forward\nProbably has some nifty tips\n",
    "glasses": "You found your glasses!!\nHow'd they end up here?",
    "askShaq": "What's up, I'm Shaq!\nI'm here to help guide you out of Eric's house.\nIf you get stuck, feel free to type 'ask Shaq' at any point and i'll do my best to help you in your escape.\nTo get started, why don't you try inspecting that table to your left and reading that note.",
    "invalidCommand": "That command is invalid! Please choose a proper command from the list."
  },
  "kitchen": {
    "enterRoom": "Welcome to Room 1 - Knife Room:\nTo your left you see a bookshelf.\nTo your right you see a table.\nStraight ahead is the locked door to the next room.",
    "hutch": "A storage chest.",
    "radio": "Let's play some tunes",
    "fridge": "Always knock on the fridge before opening.\nJust in case there is a salad dressing",
    "cabinet": "As my wife opened the cabinet,\na coffee cup crashed on her head\nIt's awful to see someone you love mugged.",
    "oven": "Tried to follow a recipe,\nit said for a bigger portion just double everything,\nbut my oven doesn’t go up to 600 degrees.",
    "sink": "It's sink or swim.",
    "avocados": "Holy Guacamole!\nThese are going to be helpful later on.",
    "oranges": "Doing all this dev work..\nNeed that vitamin C.",
    "inspectLeft": "You inspect the bookshelf to your left. You find a knife and put it in your backpack.",
    "inspectLeftEmpty": "You inspect the bookshelf. Just a bunch of dusty worn out books.",
    "inspectRight": "You inspect the table on the right. You find a knife and read:\n\t'This dang old door lock has been messed up for weeks. I just keep jimmying it open with a knife.'",
    "inspectFloor": "There is nothing on the floor.",
    "openDoorLocked": "The door is locked with a big rusty padlock. There must be some way to open it...",
    "openDoorUnlocked": "You use the knife to jimmy open the lock. The door opens and you proceed to the next room...",
    "askShaq": "To figure out what the room challenge is, try to open the locked door.\nMake sure you look for helpful clues or items in every room.\nMaybe the note on that table can offer up a clue.",
    "invalidCommand": "That command is invalid! Please choose a proper command from the list."
  },
  "living-room": {
    "enterRoom": "Welcome to Room 2 - Word Order Room:\nTo your left you see a table.\nTo your right you see a desk.\nYou also see something shiny on the floor in front of you.\nStraight ahead is the locked door to the next room.",
    "inspectLeft": "You inspect the table to your left.\nYou find an Onion and put it in your backpack.\nMight come in handy or make a good snack later.",
    "inspectLeftEmpty": "You inspect the table to your left and find it empty.",
    "inspectRight": "You inspect the desk on the right.\nYou find a Hammer and a Pencil sitting on top and an Emerald in the top drawer.\nYou put them both in your backpack.",
    "inspectRightEmpty": "Just an old empty Desk over there.",
    "inspectFloor": "You inspect the floor.\nYou find a Needle on the ground and put it in your backpack.\nThat would've been uncomfortable to step on.",
    "inspectFloorEmpty": "Nothing on the floor but dirt... Eric could stand to sweep up...",
    "openDoorLocked": "An offering of four objects in the correct order is required to OPEN this door.",
    "openDoorLockedWithItems": "You have collected the correct items. Enter them in the correct order to open this door.",
    "openDoorLockedIncorrectOrder": "That is the wrong order! BE GONE!",
    "openDoorUnlocked": "You have successfully entered the four object in the correct order.\nThe door opens and you proceed to the next room...",
    "askShaq": "Those are some random objects in this room.\nPerhaps the order of the objects doesn't have anything to do with the items themselves...",
    "invalidCommand": "That command is invalid! Please choose a proper command from the list.",
    "ericClosingIn": "Eric is getting closer..."
  },
  "bedroom": {
    "enterRoom": "You made it Room 3 - The Riddle Room:\nIn this room you will need to solve 3 riddles in order to advance to the next room, good luck",
    "car-toy": {
      "riddle": "You inspect the car and find a note.\nWhat gets wetter the more it dries?",
      "answers": {
        "one": "Water",
        "two": "Dishes",
        "three": "Towel",
        "correct": "3",
        "correctOut": "You have correctly answered this question\nThe car beeps with joy!",
        "falseOut": "You have chosen the wrong answer\nThink about a sponge or something..."
      }
    },
    "bird": {
      "riddle": "The bird tweets at you...\nHow many letters are in The Alphabet?",
      "answers": {
        "one": "11",
        "two": "26",
        "three": "15",
        "correct": "1",
        "correctOut": "You have correctly answered this question\n'The Alphabet' DOES have 11 letters!\nGood luck on your journey SQWAAAAWK",
        "falseOut": "You have chosen the wrong answer\nHint: Try thinking about it another way"
      }
    },
    "bear-plushie": {
      "riddle": "The bear grumbles....\nWhat's the question you can never answer yes to?",
      "answers": {
        "one": "Can we extend the sprint?",
        "two": "Are you asleep?",
        "three": "What is your favorite color?",
        "correct": "2",
        "correctOut": "That's the one, have a beary good day!",
        "falseOut": "You have chosen the wrong answer\nHint: Can't answer at this time."
      }
    },
    "door": {
      "locked": "Look through the items in the room.\nThey have riddles for you to answer.\nSolve the three riddles to open this door.",
      "unlocked": "You have successfully completed all 3 Riddles in the room, you may advance to the next room"
    },
    "askShaq": "Think about your answers, if you answer incorrectly, you will lose time",
    "side-table-girl": "That's a cute side-table, nice and pink!",
    "side-table-boy": "That's a cute side-table, nice and blue!",
    "bed": "It would be nice to rest, but you don't have time\nERIC IS COMING!",
    "toys": "You wish you had a cool chest like this for your toys.",
    "play-desk": "This desk is perfect for coloring.\nMaybe later.",
    "play-chair": "It would be nice to rest, but you don't have time\nERIC IS COMING!",
    "football": "Footballs alright\nBut you would rather be exploring caves.",
    "blocks": "The blocks spell out.\nI.M.C.O.M.I.N.G.F.O.R.Y.O.U\nYou wonder what 'I, M.C. Omingfo ryou' means\nM.C Oming seems like a nice guy"
  },
  "bathroom": {
    "david-mirror": {
      "info": "Lets play rock paper scissors! Best two out of three wins!",
      "pick": {
        "rock": "Rock",
        "paper": "Paper",
        "scissors": "Scissors"
      }
    },
    "enterRoom": "Welcome to Room 4 - Game Room:\nAn anvil sits in the middle of the room\nTo your right is a big storage shelf full of odds and ends\nTo your left you see an old dresser\nStraight ahead is the locked door to the next room.",
    "inspectLeft": "You open the door of the old dresser and find a pair of mirrored glasses and put them on.\nVery Stylish!",
    "inspectLeftEmpty": "Theres nothing left in the empty old dresser.",
    "inspectRight": "The shelf contains several piles of supplies. You collect some paper, a thin sheet of metal, and a wrench.",
    "inspectRightEmpty": "Nothing else of good use on the shelf.",
    "inspectFloor": "You walk up to the anvil in the center of the room. Could come in handy to craft something.\nWould you like to craft something? (y/n)",
    "inspectFloorCraftHat": "You've crafted a metal hat! You put it on, a perfect fit.",
    "inspectFloorCraftAirplane": "You've crafted a paper airplane. You throw it at the locked door... it does nothing.",
    "inspectFloorCraftFail": "You cant craft anything with this combo.",
    "openDoorLocked": "A mirror hangs on the door with a reflection of yourself.\nYour reflection smiles back and holds up one hand flat with the other fist sitting on top.\nHe is challenging you to rock-paper-scissors! (Best 2 out of 3)",
    "openDoorLockedLoser": "The Door has won this round.",
    "openDoorUnlocked": "YOU WIN! The door opens and you feel the cool breeze of fresh air on your face.\nYou step outside the house and realize you have escaped.You have escaped Eric!",
    "askShaq": "That is no ordinary mirror on the door... i think its somehow reading your mind!\nIf you can find a way to keep it out of your head i bet you can beat it!"
  },
  "ericAppears": "Eric Appeared!!!!\nHe lunges at you violently at full speed with crackhead like energy.\n He picks you up as if you were a toy AND HE GIVES YOU A hug :)\nEric asks why you were running through his house? Turns out, he just wanted to talk to you. He just wanted a friend."
}